app/views/messages/show.html.erb

DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 74]]
---
  <%= @message.text %>
  <% @message.destroy %>