app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 67], ["LIMIT", 1]]
---
  def show
    @message = Message.find(params[:id])

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "the value of the message"], ["created_at", "2017-11-05 15:10:41.619895"], ["updated_at", "2017-11-05 15:10:41.619895"]]
---
  def create
    if request.content_type =~ /xml/
      message_hash = Hash.from_xml(request.body.read)

      params[:message] = {"content" => message_hash["message"]}

      @message = Message.create(message_params)